1С_ChatBot/DataProcessors/Бот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Бот</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1С_ChatBot/InformationRegisters/Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Подписчики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действителен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>chat_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1С_ChatBot/DataProcessors/Бот/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Токен = Константы.TelegramBotToken.Получить();
	ПомечатьСообщенияПрочитанными = Истина;
КонецПроцедуры

#Область ПолучениеСообщений

&НаКлиенте
Процедура ПолучитьСообщения(Команда)
	ПолучитьСообщенияНаСервере();	
КонецПроцедуры       

&НаКлиенте
Процедура ИнфоОБоте(Команда)                        
	ИнфоОБотеНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияНаСервере()
	
	ТокенБота = АктуальныйТокенБота();
	Если Не ЗначениеЗаполнено(ТокенБота) Тогда
		СообщенияТекст = НСтр("ru = 'Не задан токен Telegram. Укажите его в поле «Токен» или в константе TelegramBotToken.'");
		Возврат;
	КонецЕсли;
	
	СообщенияТекст = "";      
	НомерПоследнегоПрочитанногоСообщения = Константы.update_id.Получить();
	Если НомерПоследнегоПрочитанногоСообщения <> 0 Тогда
		Ответ = OPI_Telegram.ПолучитьОбновления(ТокенБота, , НомерПоследнегоПрочитанногоСообщения + 1);
	Иначе
		Ответ = OPI_Telegram.ПолучитьОбновления(ТокенБота);
	КонецЕсли;
	БотРаботает = Ответ["ok"];
	Если БотРаботает Тогда  
		ОбработатьСообщения(Ответ["result"]);
	КонецЕсли;
	
КонецПроцедуры   


&НаСервере
Процедура ИнфоОБотеНаСервере()                        
	
	ТокенБота = АктуальныйТокенБота();
	Если Не ЗначениеЗаполнено(ТокенБота) Тогда
		СообщенияТекст = НСтр("ru = 'Не задан токен Telegram. Укажите его в поле «Токен» или в константе TelegramBotToken.'");
		Возврат;
	КонецЕсли;
	
	СообщенияТекст = "";
	Ответ = OPI_Telegram.ПолучитьИнформациюБота(ТокенБота);   
	БотРаботает = Ответ["ok"];
	Если БотРаботает Тогда 
		first_name 	= Ответ["result"]["first_name"];
		username 	= Ответ["result"]["username"];
		
		СообщенияТекст = "first_name: " + first_name + Символы.ПС + "username: " + username;
	Иначе
		СообщенияТекст = "Нет такого бота.";
	КонецЕсли;
	
КонецПроцедуры       

&НаСервере
Процедура ОбработатьСообщения(Сообщения)  
	Для каждого СообщениеЭлемент из Сообщения Цикл
		Сообщение = СообщениеЭлемент["message"];
		
		ДатаСообщения = Дата(1970, 1, 1) + 3600 * 3 + Сообщение["date"];
		Отправитель = Сообщение["from"]["username"];
		ЗаписатьОтправителя(Сообщение["chat"]["id"]);
		
		ТекстСообщения = "";
		Если Сообщение["text"] <> Неопределено Тогда
			ТекстСообщения = Сообщение["text"]; 
		КонецЕсли;
		Если Сообщение["photo"] <> Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "|Есть фото|"; 
		КонецЕсли;       
		Если Сообщение["caption"] <> Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "|Подпись:" + Сообщение["caption"] + "|"; 
		КонецЕсли;          
		

		СообщенияТекст = СообщенияТекст + ДатаСообщения + " - " + Отправитель + ": " + Символы.ПС
										+ ТекстСообщения + Символы.ПС + Символы.ПС;
		
		Если ПомечатьСообщенияПрочитанными Тогда
			Константы.update_id.Установить(СообщениеЭлемент["update_id"]);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры 


&НаСервереБезКонтекста
Процедура ЗаписатьОтправителя(chat_id)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подписчики.Действителен КАК Действителен
		|ИЗ
		|	РегистрСведений.Подписчики КАК Подписчики
		|ГДЕ
		|	Подписчики.chat_id = &chat_id";
	
	Запрос.УстановитьПараметр("chat_id", chat_id);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		МЗ = РегистрыСведений.Подписчики.СоздатьМенеджерЗаписи();
		МЗ.chat_id = chat_id;
		МЗ.Действителен = Истина;
		МЗ.Записать();
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ОтправитьСообщениеНаСервере()   
	
	ТокенБота = АктуальныйТокенБота();
	Если Не ЗначениеЗаполнено(ТокенБота) Тогда
		Возврат;
	КонецЕсли;
	
	OPI_Telegram.ОтправитьТекстовоеСообщение(ТокенБота, Формат(ПолучательChat_id, "ЧГ=0"), ТекстОтправляемогоСообщения);
	
КонецПроцедуры
  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АктуальныйТокенБота()
	
	Если ЗначениеЗаполнено(Токен) Тогда
		Если Токен <> Константы.TelegramBotToken.Получить() Тогда
			Константы.TelegramBotToken.Установить(Токен);
		КонецЕсли;
		Возврат Токен;
	КонецЕсли;
	
	Возврат Константы.TelegramBotToken.Получить();
	
КонецФункции

#КонецОбласти
